doc/manual.org
#+TITLE: The Vorlage Manual
#+AUTHOR: Kevin Marschke <kmarshcke@ellem.ai>
#+latex_header: \hypersetup{colorlinks=true}
Copyright \copy 2020 Ellem, Inc., all rights reserved.
* Introduction
This is a reference manual for the Vorlage. For more
information and other documents, see [[https://ellem.ai/d-document-compiler][ellem.ai/d-document-compiler]].

vorlage puts together text documents by looking for specific
macros within the text documents themselves (such as .html, .txt, .js,
ect). Once compiled, the completed document is cached and can be
served over a variety of channels (http, fcgi, cli, ect).
** Example
The best way to learn is with examples. Observe the following files:

*header.html*
#+NAME: header.html
#+BEGIN_SRC html
<html>
<body>
<head><title>$(Title)</title></head>
#+END_SRC

*footer.html*
#+NAME: footer.html
#+BEGIN_SRC html
</body>
</html>
#+END_SRC

*myproc.go*
#+NAME: myproc.go
#+BEGIN_SRC go
// ...
func MyIP() string {
    return getRemoteIP()
}
// ...
#+END_SRC

And finally, *index.html*
#+NAME: index.html
#+BEGIN_SRC html
#prepend header.html
#append footer.html
#define $(MyName) Kevin
#define $(Title) Home Page

<p>Hello, my name is $(MyName).</p>
<p>My IP is $(myproc.MyIP)!</p>
#+END_SRC

Vorlage will output the following:
#+NAME: output-example
#+BEGIN_SRC html
<html>
<body>
<head><title>Home Page</title></head>
<p>Hello, my name is Kevin.</p>
<p>My IP is 127.0.0.1!</p>
</body>
</html>
#+END_SRC
** Purpose
Here it is. Ellem has been working with HTTP/HTML for literally
decades and we have never loved doing it until now. 

We've seen everything; php, node, react, webassembly, apache, nginx,
coldfusion, dart, typescript, asp.net, drupal, squarespace,
wordpress. Why have all these products and technologies been made?
What problem is so big that there needs to have an endless amount of
solutions to support it? The problem is simple:

*HTTP sucks.*

The entire planet has adopted a standard that was never in a million
years supposed to be as widely used as it is now. HTML was made in a
weekend by 1 man who had no advanced knowledge in computer
engineering. HTTP was made by a small team trying to solve a problem
they had between a team of 50 people. Javascript was made in 2 weeks
and is named after another language to trick people in to using
it. But now: we've chosen these crappy technologies to serve as the
backbone to the most important wealth of knowledge in the history of
the solar system.

Ellem plans to mend the damage caused by the Internet's choice of
protocol with Vorlage. People using Vorlage will be forced to do
everything very deliberately and explicitly, all while being forced to
provide comprehensive documentation to every step.

*No more chaos. Vorlage demands order.*

* Components
There's four distinct components to the Vorlage:
*[[Documents][Documents]]*, *[[Input][Input]]*, *[[Variables][Variables]]*, *[[Macros][Macros]]*, and
*[[Processors][Processors]]*. Documents are simply files such as text files, HTML
files, ect. Input is what the user has given in regards to the
generation of the document. Variables are symbols found in the
document that will be replaced with arbitrary text when the document
is compiled.  Macros are used to append and prepend documents, as well
as define variables. Finally, Processors are used to integrate complex
formation of what is known as [[Processed][Processed]] variables.

Note that additional, more technical components such as caching, how
Documents are requested, and how documents are served will not be
covered in this manual. This manual is strictly for those wanting to
use the Vorlage, not develop for it.

** Loading Process
 1. *Startup Phase*: Vorlage loads all processors and loads all
    supporting libraries. After this phase, Vorlage is ready to
    concurrently handle multiple requests indefinitely.
 2. *Requesting Phase*: A file path is requested by the user through
    Vorlage. This requested path is known as the "root
    document". The user will also specify input at this point. Once
    the Request has been fully loaded, it then enters the Loading
    Phase.
 3. *Loading Phase*: Vorlage loads the root
    document and does the following actions known as "docload":
    1. Vorlage then evaluates [[Macros][Macros]] found in the document in order of
       appearance.
    2. Vorlage attempts to open documents specified in the [[#append]] and
       [[#prepend]] macros that were evaluated in 1. These documents are
       known as "child documents"
    3. Each child document is then sent through docload (this in-turn
       making docload a recursive process).
    Once docload is complete, the root document and child documents
    are sent to their converters in order to go from their [[Source
    Format]] to their [[Target Format][Target Format]]. At this point we're ready to move
    to the Output Phase. Note that the Loading Phase can be skipped
    and/or shorten with the use of chaching.
 4. *Output Phase*: With the processors ready, request information
    parsed, document and child documents loaded into their Target
    Format, and all [[#define]] macros evaluated, the Output Phase can
    begin. A document in the Output Phase can be streamed to the user
    who had requested the document in the first place. This is the end
    of the life cycle for the document.
 5. *Shutdown Phase*: Vorlage unloads all the processors and deloads
    all supporting libraries. All connections and requests will be
    terminated.

