doc/manual.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>The Vorlage Manual</title>
<!-- 2020-12-22 Tue 17:21 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Kevin Marschke &lt;kmarshcke@ellem.ai&gt;" />
</head>
<body>
<div id="content">
<h1 class="title">The Vorlage Manual</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a>
<ul>
<li><a href="#sec-1-1">1.1. Example</a></li>
<li><a href="#sec-1-2">1.2. Purpose</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Components</a>
<ul>
<li><a href="#sec-2-1">2.1. Loading Process</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Documents</a>
<ul>
<li><a href="#sec-3-1">3.1. Source Formats</a></li>
<li><a href="#sec-3-2">3.2. Target Formats</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Macros</a>
<ul>
<li><a href="#sec-4-1">4.1. #define</a></li>
<li><a href="#sec-4-2">4.2. #append</a></li>
<li><a href="#sec-4-3">4.3. #prepend</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Processors</a>
<ul>
<li><a href="#sec-5-1">5.1. Processor File</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Variables</a>
<ul>
<li><a href="#sec-6-1">6.1. Normal</a></li>
<li><a href="#sec-6-2">6.2. Processed</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Input</a>
<ul>
<li><a href="#sec-7-1">7.1. Static Argument values</a></li>
<li><a href="#sec-7-2">7.2. Streamed Argument Values</a></li>
<li><a href="#sec-7-3">7.3. Processor Input</a></li>
</ul>
</li>
<li><a href="#sec-8">8. Further Elaboration on Technical Details</a>
<ul>
<li><a href="#sec-8-1">8.1. Circular Dependencies</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Copyright &copy; 2020 Ellem, Inc., all rights reserved.
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a reference manual for the Vorlage. For more
information and other documents, see <a href="https://ellem.ai/d-document-compiler">ellem.ai/d-document-compiler</a>.
</p>

<p>
vorlage puts together text documents by looking for specific
macros within the text documents themselves (such as .html, .txt, .js,
ect). Once compiled, the completed document is cached and can be
served over a variety of channels (http, fcgi, cli, ect).
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Example</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The best way to learn is with examples. Observe the following files:
</p>

<p>
<b>header.html</b>
</p>
<div class="org-src-container">

<pre class="src src-html" id="header.html">&lt;html&gt;
&lt;body&gt;
&lt;head&gt;&lt;title&gt;$(Title)&lt;/title&gt;&lt;/head&gt;
</pre>
</div>

<p>
<b>footer.html</b>
</p>
<div class="org-src-container">

<pre class="src src-html" id="footer.html">&lt;/body&gt;
&lt;/html&gt;
</pre>
</div>

<p>
<b>myproc.go</b>
</p>
<div class="org-src-container">

<pre class="src src-go" id="myproc.go">// ...
func MyIP() string {
	return getRemoteIP()
}
// ...
</pre>
</div>

<p>
And finally, <b>index.html</b>
</p>
<div class="org-src-container">

<pre class="src src-html" id="index.html">#prepend header.html
#append footer.html
#define $(MyName) Kevin
#define $(Title) Home Page

&lt;p&gt;Hello, my name is $(MyName).&lt;/p&gt;
&lt;p&gt;My IP is $(myproc.MyIP)!&lt;/p&gt;
</pre>
</div>

<p>
Vorlage will output the following:
</p>
<div class="org-src-container">

<pre class="src src-html" id="output-example">&lt;html&gt;
&lt;body&gt;
&lt;head&gt;&lt;title&gt;Home Page&lt;/title&gt;&lt;/head&gt;
&lt;p&gt;Hello, my name is Kevin.&lt;/p&gt;
&lt;p&gt;My IP is 127.0.0.1!&lt;/p&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Purpose</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Here it is. Ellem has been working with HTTP/HTML for literally
decades and we have never loved doing it until now. 
</p>

<p>
We've seen everything; php, node, react, webassembly, apache, nginx,
coldfusion, dart, typescript, asp.net, drupal, squarespace,
wordpress. Why have all these products and technologies been made?
What problem is so big that there needs to have an endless amount of
solutions to support it? The problem is simple:
</p>

<p>
<b>HTTP sucks.</b>
</p>

<p>
The entire planet has adopted a standard that was never in a million
years supposed to be as widely used as it is now. HTML was made in a
weekend by 1 man who had no advanced knowledge in computer
engineering. HTTP was made by a small team trying to solve a problem
they had between a team of 50 people. Javascript was made in 2 weeks
and is named after another language to trick people in to using
it. But now: we've chosen these crappy technologies to serve as the
backbone to the most important wealth of knowledge in the history of
the solar system.
</p>

<p>
Ellem plans to mend the damage caused by the Internet's choice of
protocol with Vorlage. People using Vorlage will be forced to do
everything very deliberately and explicitly, all while being forced to
provide comprehensive documentation to every step.
</p>

<p>
<b>No more chaos. Vorlage demands order.</b>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Components</h2>
<div class="outline-text-2" id="text-2">
<p>
There's four distinct components to the Vorlage:
<b><a href="#sec-3">Documents</a></b>, <b><a href="#sec-7">Input</a></b>, <b><a href="#sec-6">Variables</a></b>, <b><a href="#sec-4">Macros</a></b>, and
<b><a href="#sec-5">Processors</a></b>. Documents are simply files such as text files, HTML
files, ect. Input is what the user has given in regards to the
generation of the document. Variables are symbols found in the
document that will be replaced with arbitrary text when the document
is compiled.  Macros are used to append and prepend documents, as well
as define variables. Finally, Processors are used to integrate complex
formation of what is known as <a href="#sec-6-2">Processed</a> variables.
</p>

<p>
Note that additional, more technical components such as caching, how
Documents are requested, and how documents are served will not be
covered in this manual. This manual is strictly for those wanting to
use the Vorlage, not develop for it.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Loading Process</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li><b>Startup Phase</b>: Vorlage loads all processors and loads all
supporting libraries. After this phase, Vorlage is ready to
concurrently handle multiple requests indefinitely.
</li>
<li><b>Requesting Phase</b>: A file path is requested by the user through
Vorlage. This requested path is known as the "root
document". The user will also specify input at this point. Once
the Request has been fully loaded, it then enters the Loading
Phase.
</li>
<li><b>Loading Phase</b>: Vorlage loads the root
document and does the following actions known as "docload":
<ol class="org-ol">
<li>Vorlage then evaluates <a href="#sec-4">Macros</a> found in the document in order of
appearance.
</li>
<li>Vorlage attempts to open documents specified in the <i>#append</i> and
<i>#prepend</i> macros that were evaluated in 1. These documents are
known as "child documents"
</li>
<li>Each child document is then sent through docload (this in-turn
making docload a recursive process).
</li>
</ol>
<p>
Once docload is complete, the root document and child documents
are sent to their converters in order to go from their <i>Source
    Format</i> to their <i>Target Format</i>. At this point we're ready to move
to the Output Phase. Note that the Loading Phase can be skipped
and/or shorten with the use of chaching.
</p>
</li>
<li><b>Output Phase</b>: With the processors ready, request information
parsed, document and child documents loaded into their Target
Format, and all <i>#define</i> macros evaluated, the Output Phase can
begin. A document in the Output Phase can be streamed to the user
who had requested the document in the first place. This is the end
of the life cycle for the document.
</li>
<li><b>Shutdown Phase</b>: Vorlage unloads all the processors and deloads
all supporting libraries. All connections and requests will be
terminated.
</li>
</ol>
</div>
</div>
</div>
