doc/manual.org
* Documents
Documents are UTF-8 encoded files. The text is not canonicalized, so a
single accented code point is distinct from the same character
constructed from combining an accent and a letter; those are treated
as two code points.

All documents are considered to have *[[Source Formats][Source Formats]]* as well their
desired *[[Target Formats][Target Formats]]*. These source formats and target formats will
change from version to version. In regards to Vorlage
v1.0.0, the supported formats are listed below as well as their file
extension (which will become important later).

A single Document can prepend and appened an unlimited number of other
Documents with the use of [[Macros][Macros]]. A Document can also define variables
(using [[#define]]) to be used within that document, or, by documents that
include it or included by it.
** Source Formats
 - [[https://html.spec.whatwg.org/multipage/][html]] (.html)
** Target Formats
 - [[https://html.spec.whatwg.org/multipage/][html]] (.html)
* Macros
Macros are actions to perform during the compilation of a
Document. The presence of Macros are completely removed from the
Document(s) after they are compiled. The identity of a Macro must
follow this syntax:

 1. Must be either at the very start of the Document or be directly
    after by another Macro,
 2. must start with =#= called a *Macro Prefix*,
 3. followed by a UTF-8 alpha string called the *Marco Name*
 4. followed by arbitrary text called *Arguments*... of which each one
    is proceeded by a space (char code =0x20=) and optionally wrapped
    in double quotation marks (char code =0x22=), and;
 5. will be ended with 1 newline (char code =0x10=).

Available Macros:

 - [[#define]]
 - [[#append]]
 - [[#prepend]]

** #define
This macro defines a [[Normal][Normal]] Variable. It has 2 arguments, the first
argument being the Normal Variable and the second being what it will
be defined as. Note that the first argument must be the entirety of
the Normal Variable and not just the Variable Name, this means the
=#define= will include the Variable Prefix =$(= and Variable
Suffix =)=. For example

#+BEGIN_SRC html
#define $(Name) Kevin

Hello, my name is $(Name).
#+END_SRC

Note that if =#define= attempts to define an previously defined
variable, the Document will not be compiled and will return an error.

** #append
Append includes a Document (the includee) that, when compiled, be
outputted /after/ the includer. The includee's Macros will
be processed the instant the #append is evaluated.

Note: [[Circular Dependency][Circular Dependency]] is detected, the Document will not
compile and an error outputted.

** #prepend
Append includes a Document (the includee) that, when compiled, be
outputted /before/ the includer. The includee's Macros will
be processed the instant the #prepend is evaluated.

Note that if a [[Circular Dependency][Circular Dependency]] is detected, the Document will not
compile and an error outputted.
* Processors
Processors provide you with the ability to perform arbitrary code
execution during points in the Request Phase and the Output
Phase. A Processor consists of the following:

 1. A Name and description of the Processor
 2. A comprehendsive list of [[Processed][its variables]] aswell as each variable's
    [[Input][input]].
 3. A list of [[Processor Input][Processor-level input]]

Under normal (non-erroneous) operation, a given Processor has a sole
duty of defining its variables. Conclusively, Processors allow
unlimited applications such as databases, authentication, logging,
auditing, searching, ect.

To create a Processor, you must first compile a *[[Processor File][Processor File]]* and
then have that file in the relevant directory so that Vorlage can load
it during the Startup Phase.

** Processor File
A Processor File is the tangible existance of a processor.

Vorlage loads all proper Processor Files during the Startup Phase and
unloads them all during the Shutdown Phase. 

A Processor File contains executable code with a unique interface that
Vorlage will work with called the *Vorlage Interface*. The exact
definition of the Vorlage Interface depends on the language the
Processor File was written in:

 - The most primative as well as the most native is an ELF amd64 LSB
   *Shared Object* (=libmyproc.so=). These can be written in
   a verity of different languages including C, C++, Go, Swift,
   Objective-C, Haskell, and Rust.
 - *Golang* Plugin (=golibmyproc.so=). Much easier to implement than a
   Shared Object.


#+BEGIN_COMMENT

Technical details on this still need to be elaborated
in full. This includes symbols and dependencies.

#+END_COMMENT

* Variables
Inside of a Document, there exists Variables. During the Output Phase,
these variables are replaced with arbitrary text (or binary) regarded
as the variable's *Definition*. Variables come in 2 flavors: *[[Normal][Normal]]*
and *[[Processed][Processed]]*, the only difference is how these their Definitions
are written (one uses [[#define]], the other uses [[Processors][Processors]], more on this
later).

At the core of everything, a Variable is identified by a unique string
of text. This string of text must follow a particular syntax to be
valid. The syntax is as follows:

 1. A variable must begin with =$(= called a *Variable Prefix*,
 2. followed by UTF-8 alphanumeric string /unless/ it is a Processed
    Variable to which a dot (=.=) is also present somewhere in the
    middle. This is called the *Variable Name*, and;
 3. finally end with =)= called a *Variable Suffix*

Note: the Vorlage will first attempt to locate Variable Prefixes and
Suffix pairs, only after that it will then determine the validity of
the variable name. If you've used an undefined and/or misformatted
Variable Name, then an Vorlage will ignore it all together.

Note: no Variable can exceed 32 characters (=MaxVariableLength=). Not
to be confused with the Variable's Definition, of which can be an
unlimited length.

Example: =$(MyName)=, is a Normal Variable, and =MyName= is the
Variable Name.

** Normal
Normal Variables are defined by using the [[#define]] macro, this define
macro can be in the root Document itself, or a Document that has been
either prepended or appended to that root Document. In any case, a
Normal Variable can be used in any document, parent or child, as
[[#define]] adds the Variable's definition to the context of the Request,
not to the root Document.

