doc/manual.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Documents</h2>
<div class="outline-text-2" id="text-3">
<p>
Documents are UTF-8 encoded files. The text is not canonicalized, so a
single accented code point is distinct from the same character
constructed from combining an accent and a letter; those are treated
as two code points.
</p>

<p>
All documents are considered to have <b><a href="#sec-3-1">Source Formats</a></b> as well their
desired <b><a href="#sec-3-2">Target Formats</a></b>. These source formats and target formats will
change from version to version. In regards to Vorlage
v1.0.0, the supported formats are listed below as well as their file
extension (which will become important later).
</p>

<p>
A single Document can prepend and appened an unlimited number of other
Documents with the use of <a href="#sec-4">Macros</a>. A Document can also define variables
(using <i>#define</i>) to be used within that document, or, by documents that
include it or included by it.
</p>
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Source Formats</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><a href="https://html.spec.whatwg.org/multipage/">html</a> (.html)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Target Formats</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><a href="https://html.spec.whatwg.org/multipage/">html</a> (.html)
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Macros</h2>
<div class="outline-text-2" id="text-4">
<p>
Macros are actions to perform during the compilation of a
Document. The presence of Macros are completely removed from the
Document(s) after they are compiled. The identity of a Macro must
follow this syntax:
</p>

<ol class="org-ol">
<li>Must be either at the very start of the Document or be directly
after by another Macro,
</li>
<li>must start with <code>#</code> called a <b>Macro Prefix</b>,
</li>
<li>followed by a UTF-8 alpha string called the <b>Marco Name</b>
</li>
<li>followed by arbitrary text called <b>Arguments</b>&#x2026; of which each one
is proceeded by a space (char code <code>0x20</code>) and optionally wrapped
in double quotation marks (char code <code>0x22</code>), and;
</li>
<li>will be ended with 1 newline (char code <code>0x10</code>).
</li>
</ol>

<p>
Available Macros:
</p>

<ul class="org-ul">
<li><i>#define</i>
</li>
<li><i>#append</i>
</li>
<li><i>#prepend</i>
</li>
</ul>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> #define</h3>
<div class="outline-text-3" id="text-4-1">
<p>
This macro defines a <a href="#sec-6-1">Normal</a> Variable. It has 2 arguments, the first
argument being the Normal Variable and the second being what it will
be defined as. Note that the first argument must be the entirety of
the Normal Variable and not just the Variable Name, this means the
<code>#define</code> will include the Variable Prefix <code>$(</code> and Variable
Suffix <code>)</code>. For example
</p>

<div class="org-src-container">

<pre class="src src-html">#define $(Name) Kevin

Hello, my name is $(Name).
</pre>
</div>

<p>
Note that if <code>#define</code> attempts to define an previously defined
variable, the Document will not be compiled and will return an error.
</p>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> #append</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Append includes a Document (the includee) that, when compiled, be
outputted <i>after</i> the includer. The includee's Macros will
be processed the instant the #append is evaluated.
</p>

<p>
Note: <i>Circular Dependency</i> is detected, the Document will not
compile and an error outputted.
</p>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> #prepend</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Append includes a Document (the includee) that, when compiled, be
outputted <i>before</i> the includer. The includee's Macros will
be processed the instant the #prepend is evaluated.
</p>

<p>
Note that if a <i>Circular Dependency</i> is detected, the Document will not
compile and an error outputted.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Processors</h2>
<div class="outline-text-2" id="text-5">
<p>
Processors provide you with the ability to perform arbitrary code
execution during points in the Request Phase and the Output
Phase. A Processor consists of the following:
</p>

<ol class="org-ol">
<li>A Description of the Processor
</li>
<li>A comprehendsive list of <a href="#sec-6-2">its variables</a> aswell as each variable's
<a href="#sec-7">input</a>.
</li>
<li>A list of <a href="#sec-7-3">Processor-level input</a>
</li>
</ol>

<p>
<i>Note, the actual name of the processor is dictated by the name of the
encompassing <a href="#sec-5-1">Processor File</a>.</i>
</p>

<p>
Under normal (non-erroneous) operation, a given Processor has a sole
duty of defining its variables. Conclusively, Processors allow
unlimited applications such as databases, authentication, logging,
auditing, searching, ect.
</p>

<p>
To create a Processor, you must first compile a <b><a href="#sec-5-1">Processor File</a></b> and
then have that file in the relevant directory so that Vorlage can load
it during the Startup Phase.
</p>

<p>
/Note, Processors are technical in nature. An increase dependency on
them will lead to difficult-to-edit documents that defeats entire
purpose of Vorlage./
</p>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Processor File</h3>
<div class="outline-text-3" id="text-5-1">
<p>
A Processor File is the tangible existance of a processor. A processor Fil
</p>

<p>
A processor file contains native code that contains the proper
exports. Support for types of processor files will variety as Vorlage
gains maturity. As of now, the following supported file types (and
formats) are supported:
</p>

<ul class="org-ul">
<li>ELF 64-bit LSB shared object (see <a href="http://tldp.org/HOWTO/Program-Library-HOWTO/shared-libraries.html">here</a>) (<code>libmyproc.so</code>)
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Variables</h2>
<div class="outline-text-2" id="text-6">
<p>
Inside of a Document, there exists Variables. During the Output Phase,
these variables are replaced with arbitrary text (or binary) regarded
as the variable's <b>Definition</b>. Variables come in 2 flavors: <b><a href="#sec-6-1">Normal</a></b>
and <b><a href="#sec-6-2">Processed</a></b>, the only difference is how these their Definitions
are written (one uses <i>#define</i>, the other uses <a href="#sec-5">Processors</a>, more on this
later).
</p>

<p>
At the core of everything, a Variable is identified by a unique string
of text. This string of text must follow a particular syntax to be
valid. The syntax is as follows:
</p>

<ol class="org-ol">
<li>A variable must begin with <code>$(</code> called a <b>Variable Prefix</b>,
</li>
<li>followed by UTF-8 alphanumeric string <i>unless</i> it is a Processed
Variable to which a dot (<code>.</code>) is also present somewhere in the
middle. This is called the <b>Variable Name</b>, and;
</li>
<li>finally end with <code>)</code> called a <b>Variable Suffix</b>
</li>
</ol>

<p>
Note: the Vorlage will first attempt to locate Variable Prefixes and
Suffix pairs, only after that it will then determine the validity of
the variable name. If you've used an undefined and/or misformatted
Variable Name, then an Vorlage will ignore it all together.
</p>

<p>
Note: no Variable can exceed 32 characters (<code>MaxVariableLength</code>). Not
to be confused with the Variable's Definition, of which can be an
unlimited length.
</p>

<p>
Example: <code>$(MyName)</code>, is a Normal Variable, and <code>MyName</code> is the
Variable Name.
</p>
</div>

<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Normal</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Normal Variables are defined by using the <i>#define</i> macro, this define
macro can be in the root Document itself, or a Document that has been
either prepended or appended to that root Document. In any case, a
Normal Variable can be used in any document, parent or child, as
<i>#define</i> adds the Variable's definition to the context of the Request,
not to the root Document.
</p>
</div>
</div>
