doc/manual.org
** Processed
Processed Variables are tangibly different from Normal variables
because their Variable Name has a dot (=.=) separating the
later-discussed *[[Processor Name][Processor Name]]* and the name familiar with the
Processor called the *Processor-Variable Name*.

Example: =$(myproc.BlobPosts)= is a Processed variable,
=myproc.BlogPosts= is the Variable Name, =myproc= is the Processor
Name, and =BlobPosts= is the Processor-Variable Name.

Any given Processed Variable may require *[[Input][Input]]* of which is loaded in
during the Request Phase. Thus, Processor Variables are a lot like
function call.

Once a Processed Variable has been fully loaded, meaning that the
processor was fully loaded, the variable was found, and the inputs are
a match, the processor will then be responsible for defining it. Note
that any errors that occur during definition will not stop the overall
Request. Thus, Processors have no ability to hinder the Output Phase
with the exception of memory violations, which will kill the process
overall.

** Nested Variables

For Normal Variables, they can make use of "nested" variables;
both normal and processed variables will be defined normal variables.
Processor variables cannot make use of nested variables, their definitions
will be outputted verbaitum.

For example:

#+BEGIN_SRC html
#define $(Name) Kevin
#define $(Hello) Hello, my name is $(Name) and the time is $(myproc.Time)

$(Hello)

#+END_SRC

The above will output "Hello, my name is Kevin and the time is 10:30 PM".

If the compiler finds a circular-defintion of a single, or collection
of variables, an error will occur during the Output Phase.

* Input
During the Startup Phase, each [[Processed][Processed Variable]] has the option to
specify a list of arguments (also refered to as input prototype) known
as *Variable Input*. Furthermore, the Processor itself has the option
to provide a processor-level list of Arguments/Input Prototype refered
to as *[[Processor Input][Processor Input]]*. Each argument will have a name and
description that will be visible to the front-end developer.

Input will only be given to the Variable/Processor by Vorlage when it
was explicitly asked for by during the Startup Phase. Thus, a variable
amount of arguments is not possible. The Processor Developer must be
very specific and very mindful of the front-end developer's abilities
to understand how to use the input.

Input is supplied by the user during the Requesting Phase and that
same Input is used throughout the request's lifecycle and doesn't
change.

Example: If =$(mytranslator.german)= is detected inside the document,
the processor =mytranslator= will be loaded and that processor will
then demand that the =german= variable be supplied an Input with the
variable name of =english=. As you can see, =$(mytranslator.german)=
translates English to German. For a more applied example, if we were
in the context of HTTP/HTML, the request
=www.mywebsite.com/germantranslator.proc.html?english=Hello= will
cause all instances of =$(mytanslator.german)= in
=germantranslator.proc.html= to be compiled to "Guten Tag".

#+BEGIN_COMMENT  I don't want to specify static/streamed in here. leave it impl-specific

Values comes in two forms: *[[Static Argument values][Static]]* and *[[Streamed Values][Streamed Values]]*. The list of
Input Names for a given Processor Variable must be mutually exclusive
between Static and Streamed.

** Static Argument values
Static Values are simple, and should be used more or less 95% of the
time with Vorlage. Static Values are given to the Processor
in entirety. The translator above is an example of static values.

So you're probably wondering, "static values seems like everything
I'll ever need... what is this other type of value?", Let's move on.

** Streamed Argument Values
Streamed Values are complex in nature but very powerful. Streamed
values are NOT given to the Processor in entirety. The Processor is
instead given a file descriptor to which it can read from.

An example of when you should use Inputs with Streamed Value is file
uploads. For instance if you try to upload a 6GiB file and supply
it too the processor via a Static Value that would mean you'd need to
store the entire file in 6GiB of memory. Using a Streamed Value means
vorlage doesn't need to read the entire file.

There's a drawback with Streamed Values, and that's its inability to
be supplied more than once. Inputs using Streamed Values can only be
used once per Compilation.

For instance, if =$(myconverter.ToPNG)= requires a =imageFile= Input
to be streamed, it will output the PNG conversion. But,
=$(myconverter.ToJPEG)= also requires a =imageFile= Input to be
streamed. Thus an error will occour if you try to include both
=$(myconverter.ToPNG)= and =$(myconverter.ToJPEG)= on the same page
because one will read the stream to its end and the other will be
given nothing but an empty stream.

Note that it is still possible to make that practical example work,
but you'd have to add a better degree of backend engineering, such as
to replace the use of 2 Streamed Values with 1 Streamed Values and 2
other Processed Variables that will read from a file saved by Streamed
Value Input and output the conversions.


#+END_COMMENT
** Processor Input
During the Request Phase, each processor will be given their
respective Processor Input in the same form as if it was being given
to a Processor Variable.

This give the processors an opportunity to react to the request itself,
at this time the processor may demand that the overall request be
terminated or perform other actions that is proper to the protocol
that Vorlage is using. For example, a processor may want to set
cookies in an HTTP request. And of course this cannot be done during
the Output Phase as HTTP disallows setting cookies during the
outputting of the page.

* Further Elaboration on Technical Details
** Circular Dependencies
A Circular Dependency is an error that occurs when a Document
(/Document A/) includes another Document (/Document B/) in which
includes the includer document (/Document A/). This includes a
Document trying to include itself. An example is shown below.

*Parent.html*
#+BEGIN_SRC html
#append Child.html

...
#+END_SRC



*Child.html*
#+BEGIN_SRC html
#append GrandChild.html

...
#+END_SRC


*GrandChild.html*
#+BEGIN_SRC html
#append Parent.html

...
#+END_SRC

You see that? =Parent.html= includes =Child.html= which includes
=GrandChild.html= which /then/ include =Parent.html=. Thus,
=Parent.html= is indirectly including itself, this is a circular
dependency and will cause an error.


