doc/manual.html

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Processed</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Processed Variables are tangibly different from Normal variables
because their Variable Name has a dot (<code>.</code>) separating the
later-discussed <b><i>Processor Name</i></b> and the name familiar with the
Processor called the <b>Processor-Variable Name</b>.
</p>

<p>
Example: <code>$(myproc.BlobPosts)</code> is a Processed variable,
<code>myproc.BlogPosts</code> is the Variable Name, <code>myproc</code> is the Processor
Name, and <code>BlobPosts</code> is the Processor-Variable Name.
</p>

<p>
Any given Processed Variable may require <b><a href="#sec-7">Input</a></b> of which is loaded in
during the Request Phase. Thus, Processor Variables are a lot like
function call.
</p>

<p>
Once a Processed Variable has been fully loaded, meaning that the
processor was fully loaded, the variable was found, and the inputs are
a match, the processor will then be responsible for defining it. Note
that any errors that occur during definition will not stop the overall
Request. Thus, Processors have no ability to hinder the Output Phase
with the exception of memory violations, which will kill the process
overall.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Input</h2>
<div class="outline-text-2" id="text-7">
<p>
During the Startup Phase, each <a href="#sec-6-2">Processed Variable</a> has the option to
specify a list of arguments (also refered to as input prototype) known
as <b>Variable Input</b>. Furthermore, the Processor itself has the option
to provide a processor-level list of Arguments/Input Prototype refered
to as <b><a href="#sec-7-3">Processor Input</a></b>. Each argument will have a name and
description that will be visible to the front-end developer.
</p>

<p>
Input will only be given to the Variable/Processor by Vorlage when it
was explicitly asked for by during the Startup Phase. Thus, a variable
amount of arguments is not possible. The Processor Developer must be
very specific and very mindful of the front-end developer's abilities
to understand how to use the input.
</p>

<p>
Input is supplied by the user during the Requesting Phase and that
same Input is used throughout the request's lifecycle and doesn't
change.
</p>

<p>
Example: If <code>$(mytranslator.german)</code> is detected inside the document,
the processor <code>mytranslator</code> will be loaded and that processor will
then demand that the <code>german</code> variable be supplied an Input with the
variable name of <code>english</code>. As you can see, <code>$(mytranslator.german)</code>
translates English to German. For a more applied example, if we were
in the context of HTTP/HTML, the request
<code>www.mywebsite.com/germantranslator.proc.html?english=Hello</code> will
cause all instances of <code>$(mytanslator.german)</code> in
<code>germantranslator.proc.html</code> to be compiled to "Guten Tag".
</p>

<p>
#+BEGIN<sub>COMMENT</sub>  I don't want to specify static/streamed in here. leave it impl-specific
</p>

<p>
Values comes in two forms: <b><a href="#sec-7-1">Static</a></b> and <b><i>Streamed Values</i></b>. The list of
Input Names for a given Processor Variable must be mutually exclusive
between Static and Streamed.
</p>
</div>

<div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Static Argument values</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Static Values are simple, and should be used more or less 95% of the
time with Vorlage. Static Values are given to the Processor
in entirety. The translator above is an example of static values.
</p>

<p>
So you're probably wondering, "static values seems like everything
I'll ever need&#x2026; what is this other type of value?", Let's move on.
</p>
</div>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Streamed Argument Values</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Streamed Values are complex in nature but very powerful. Streamed
values are NOT given to the Processor in entirety. The Processor is
instead given a file descriptor to which it can read from.
</p>

<p>
An example of when you should use Inputs with Streamed Value is file
uploads. For instance if you try to upload a 6GiB file and supply
it too the processor via a Static Value that would mean you'd need to
store the entire file in 6GiB of memory. Using a Streamed Value means
vorlage doesn't need to read the entire file.
</p>

<p>
There's a drawback with Streamed Values, and that's its inability to
be supplied more than once. Inputs using Streamed Values can only be
used once per Compilation.
</p>

<p>
For instance, if <code>$(myconverter.ToPNG)</code> requires a <code>imageFile</code> Input
to be streamed, it will output the PNG conversion. But,
<code>$(myconverter.ToJPEG)</code> also requires a <code>imageFile</code> Input to be
streamed. Thus an error will occour if you try to include both
<code>$(myconverter.ToPNG)</code> and <code>$(myconverter.ToJPEG)</code> on the same page
because one will read the stream to its end and the other will be
given nothing but an empty stream.
</p>

<p>
Note that it is still possible to make that practical example work,
but you'd have to add a better degree of backend engineering, such as
to replace the use of 2 Streamed Values with 1 Streamed Values and 2
other Processed Variables that will read from a file saved by Streamed
Value Input and output the conversions.
</p>


<p>
#+END<sub>COMMENT</sub>
</p>
</div>
</div>
<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> Processor Input</h3>
<div class="outline-text-3" id="text-7-3">
<p>
During the Request Phase, each processor will be given their
respective Processor Input in the same form as if it was being given
to a Processor Variable.
</p>

<p>
This give the processors an opportunity to react to the request itself,
at this time the processor may demand that the overall request be
terminated or perform other actions that is proper to the protocol
that Vorlage is using. For example, a processor may want to set
cookies in an HTTP request. And of course this cannot be done during
the Output Phase as HTTP disallows setting cookies during the
outputting of the page.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Further Elaboration on Technical Details</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Circular Dependencies</h3>
<div class="outline-text-3" id="text-8-1">
<p>
A Circular Dependency is an error that occurs when a Document
(<i>Document A</i>) includes another Document (<i>Document B</i>) in which
includes the includer document (<i>Document A</i>). This includes a
Document trying to include itself. An example is shown below.
</p>

<p>
<b>Parent.html</b>
</p>
<div class="org-src-container">

<pre class="src src-html">#append Child.html

...
</pre>
</div>



<p>
<b>Child.html</b>
</p>
<div class="org-src-container">

<pre class="src src-html">#append GrandChild.html

...
</pre>
</div>


<p>
<b>GrandChild.html</b>
</p>
<div class="org-src-container">

<pre class="src src-html">#append Parent.html

...
</pre>
</div>

<p>
You see that? <code>Parent.html</code> includes <code>Child.html</code> which includes
<code>GrandChild.html</code> which <i>then</i> include <code>Parent.html</code>. Thus,
<code>Parent.html</code> is indirectly including itself, this is a circular
dependency and will cause an error.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kevin Marschke &lt;kmarshcke@ellem.ai&gt;</p>
<p class="date">Created: 2020-12-22 Tue 17:21</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
